app/controllers/api/foods_controller.rb

INSERT INTO "foods" ("name", "calories", "protein", "carbs", "fat", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "meatball"], ["calories", 254], ["protein", 17.17], ["carbs", 0.0], ["fat", 20.0], ["created_at", "2022-08-10 17:56:17.712762"], ["updated_at", "2022-08-10 17:56:17.712762"]]
---
    def save_food(name,cal,pro,carbs,fat)
      food = Food.new(
        name: name,
        calories: cal,
        protein: pro,
        carbs: carbs,
        fat: fat
      )
      food.save