app/controllers/api/foods_controller.rb

  def get_food

    category = 'generic-foods'
    if params[:category]
      cateory = params[:category]
    end

    food = Food.where("name LIKE ?","%"+params[:name].titleize+"%").where(category: category.split('-').join(" ").capitalize)
---
SELECT "foods".* FROM "foods" WHERE (name LIKE 'Apple Juice') AND "foods"."category" = $1  [["category", "Fast foods"]]

    def parse_food(item,branded)
      name = item["food"]['label']
      calories = item["food"]['nutrients']['ENERC_KCAL']
      pro = item["food"]['nutrients']["PROCNT"]
      carbs = item["food"]['nutrients']["CHOCDF"]
      fat = item["food"]['nutrients']["FAT"]
      category = item["food"]["category"]
      brand = nil
      if branded
        brand = item["food"]["brand"]
      end

      food = Food.find_by(name: name, category: category, brand: brand)

      if food
        food
      else
        food = Food.new(name: name, calories: calories, protein: pro, fat: fat, carbs: carbs, category: category, brand:brand)
        food.save
---
SELECT "foods".* FROM "foods" WHERE "foods"."name" = $1 AND "foods"."category" = $2 AND "foods"."brand" = $3 LIMIT $4  [["name", "Tuna Sandwich"], ["category", "Fast foods"], ["brand", "Cosi"], ["LIMIT", 1]]
INSERT INTO "foods" ("name", "calories", "protein", "carbs", "fat", "brand", "category", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"