app/controllers/api/workouts_controller.rb

  def index
    @workout = Workout.where(["user_id = :user_id",{user_id: params[:user_id]}])
---
SELECT "workouts".* FROM "workouts" WHERE (user_id = NULL)

  def show
    @workout = set_workout
    @line_exercises = LineExercise.where(workout_id: @workout.id)
    @exercises = @line_exercises.map { |item|
      {exercise: Exercise.find(item.exercise_id), exercise_duration: item.exercise_duration, total_exercise_calories: item.total_exercise_calories}
---
SELECT "line_exercises".* FROM "line_exercises" WHERE "line_exercises"."workout_id" = $1  [["workout_id", 1]]
SELECT "exercises".* FROM "exercises" WHERE "exercises"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def set_workout
      @workout = Workout.find(params[:id])
---
SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create_workout()
      workout = Workout.new(
        user_id: params[:user_id],
        date: params[:date])

      user = User.find_by_id(params[:user_id])
      weight_class = ""
      if  (0..70).include?(user.weight_kg)
        weight_class = "calories_burned_s"
      elsif (71..81).include?(user.weight_kg)
        weight_class = "calories_burned_m"
      elsif (82..93).include?(user.weight_kg)
        weight_class = "calories_burned_l"
      else
        weight_class = "calories_burned_xl"
      end

      workout.total_workout_calories = cart_total_calories_burned(weight_class)
      workout.workout_duration = cart_total_duration

      enhanced_cart.each do |entry|
        exercise = entry[:exercise]
        exercise_duration = entry[:exercise_duration]
        workout.line_exercises.new(
          exercise: exercise,
          exercise_duration: exercise_duration,
          total_exercise_calories: exercise[weight_class] / 60 * exercise_duration
        )
      end

      workout.save!
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "line_exercises" ("exercise_duration", "total_exercise_calories", "exercise_id", "workout_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["exercise_duration", 30], ["total_exercise_calories", 240], ["exercise_id", 1], ["workout_id", 1], ["created_at", "2022-08-10 15:56:29.368772"], ["updated_at", "2022-08-10 15:56:29.368772"]]
INSERT INTO "workouts" ("total_workout_calories", "workout_duration", "date", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["total_workout_calories", 710], ["workout_duration", 160], ["date", "2022-08-10"], ["user_id", 1], ["created_at", "2022-08-10 15:56:29.325037"], ["updated_at", "2022-08-10 15:56:29.325037"]]