app/controllers/application_controller.rb

  def enhanced_cart
    @enhanced_cart ||= Exercise.where(id: cart.keys).map {|exercise| { exercise:exercise, exercise_duration: cart[exercise.id.to_s] } }
---
SELECT "exercises".* FROM "exercises" WHERE "exercises"."id" IN ($1, $2)  [["id", 1], ["id", 3]]