app/models/user.rb

  def self.authenticate_with_credentials(username, password)
    user = User.find_by_username(username)
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "jojo"], ["LIMIT", 1]]